# Data Science and Visualization (RUC F2023)

## Lecture 2: Exploratory Data Analysis (EDA)

# Data preprocessing and EDA

This notebook demonstrates how to preprocess data and conduct EDA

## 1. Load the dataset and look at its basic statistics

We still use the Fortune 500 dataset but this time we've copied it to a local folder.

In [1]:
import pandas as pd
import os

os.chdir('C:/Data')
# os.getcwd()

# I've stored the .csv in C:/Data/
data = pd.read_csv('fortune500.csv')
data.head()

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1

In [2]:
data.shape

(25500, 5)

All column names in a DataFrame are organized as a List (in particular, pandas.core.indexes.base.Index)

In [3]:
data.columns

Index(['Year', 'Rank', 'Company', 'Revenue (in millions)',
       'Profit (in millions)'],
      dtype='object')

Since some of the column names are not concise enough and their inline blanks may cause problems for operations later, let's change them.

In [4]:
data.columns = ['year', 'rank', 'company', 'revenue', 'profit']
data.columns

Index(['year', 'rank', 'company', 'revenue', 'profit'], dtype='object')

We can call the info() function to print a concise summary of a DataFrame object.

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25500 entries, 0 to 25499
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   year     25500 non-null  int64
 1   rank     25500 non-null  int64
 2   company  25500 non-null  object
 3   revenue  25500 non-null  float64
 4   profit   25500 non-null  object
dtypes: float64(1), int64(2), object(2)
memory usage: 996.2+ KB

In [8]:
data.isnull().sum()

year       0
rank       0
company    0
revenue    0
profit     0
dtype: int64

**Question**: What are the top-10 companies that appear in Fortunate 500 most frequently?<br>

* **value_counts()** counts the occurances for each distinct value for a given dimension.

In [12]:
data.company.value_counts().nlargest(10)

CBS               57
OfficeMax         55
General Motors    51
Anheuser-Busch    51
Ashland           51
McGraw-Hill       51
General Mills     51
H.J. Heinz        51
PepsiCo           51
USG               51
Name: company, dtype: int64

## 2. Deal with 'missing' values for 'profit' dimension

The 'profit' should be *numeric*, but why is it of the type of *object*? Let's get a description of it.

In [13]:
(data['profit']).describe()

count     25500
unique     6977
top        N.A.
freq        369
Name: profit, dtype: object

There are 369 rows in which the 'profit' dimension's value is 'N.A.'! Note this is not one of the *standard* missing value (NaN). We can call isnull() to check this.

In [14]:
data['profit'].isnull().sum()

0

We can show all those N.A. values under the 'profit' column:

In [8]:
pd.set_option('display.max_rows', None)
data['profit'][data['profit']=='N.A.']

228      N.A.
290      N.A.
294      N.A.
296      N.A.
352      N.A.
464      N.A.
712      N.A.
857      N.A.
1225     N.A.
1372     N.A.
1419     N.A.
1717     N.A.
1738     N.A.
1900     N.A.
2264     N.A.
2456     N.A.
2491     N.A.
2754     N.A.
3253     N.A.
3442     N.A.
3754     N.A.
3998     N.A.
5485     N.A.
8032     N.A.
8183     N.A.
8191     N.A.
8193     N.A.
8296     N.A.
8313     N.A.
8481     N.A.
8646     N.A.
8672     N.A.
8688     N.A.
8689     N.A.
8788     N.A.
8817     N.A.
8931     N.A.
8959     N.A.
9132     N.A.
9184     N.A.
9187     N.A.
9195     N.A.
9279     N.A.
9330     N.A.
9459     N.A.
9654     N.A.
9681     N.A.
9685     N.A.
9697     N.A.
9765     N.A.
9872     N.A.
9942     N.A.
10140    N.A.
10161    N.A.
10182    N.A.
10192    N.A.
10261    N.A.
10434    N.A.
10634    N.A.
10640    N.A.
10653    N.A.
10679    N.A.
10738    N.A.
10858    N.A.
10937    N.A.
11122    N.A.
11136    N.A.
11161    N.A.
11182    N.A.
11250    N.A.
11353    N.A.
11459    N.A.
11577    N.A.
11649    N.A.
11654    N.A.
11680    N.A.
11731    N.A.
11781    N.A.
11829    N.A.
11980    N.A.
11987    N.A.
12090    N.A.
12152    N.A.
12162    N.A.
12172    N.A.
12193    N.A.
12216    N.A.
12341    N.A.
12447    N.A.
12482    N.A.
12586    N.A.
12641    N.A.
12670    N.A.
12699    N.A.
12778    N.A.
12935    N.A.
12985    N.A.
13079    N.A.
13108    N.A.
13146    N.A.
13192    N.A.
13266    N.A.
13349    N.A.
13463    N.A.
13469    N.A.
13563    N.A.
13599    N.A.
13614    N.A.
13711    N.A.
13764    N.A.
13782    N.A.
13802    N.A.
13873    N.A.
13887    N.A.
13966    N.A.
14096    N.A.
14099    N.A.
14229    N.A.
14233    N.A.
14252    N.A.
14310    N.A.
14330    N.A.
14442    N.A.
14484    N.A.
14597    N.A.
14620    N.A.
14737    N.A.
14742    N.A.
14746    N.A.
14794    N.A.
14827    N.A.
14847    N.A.
14929    N.A.
14946    N.A.
14979    N.A.
15095    N.A.
15160    N.A.
15226    N.A.
15236    N.A.
15254    N.A.
15327    N.A.
15348    N.A.
15370    N.A.
15437    N.A.
15453    N.A.
15473    N.A.
15477    N.A.
15489    N.A.
15586    N.A.
15594    N.A.
15647    N.A.
15653    N.A.
15663    N.A.
15674    N.A.
15729    N.A.
15735    N.A.
15749    N.A.
15753    N.A.
15760    N.A.
15813    N.A.
15825    N.A.
15838    N.A.
15880    N.A.
15901    N.A.
15937    N.A.
15941    N.A.
15947    N.A.
15951    N.A.
15959    N.A.
15970    N.A.
15982    N.A.
16111    N.A.
16125    N.A.
16141    N.A.
16142    N.A.
16166    N.A.
16208    N.A.
16236    N.A.
16238    N.A.
16259    N.A.
16278    N.A.
16294    N.A.
16299    N.A.
16321    N.A.
16351    N.A.
16365    N.A.
16377    N.A.
16404    N.A.
16407    N.A.
16409    N.A.
16458    N.A.
16469    N.A.
16481    N.A.
16493    N.A.
16541    N.A.
16615    N.A.
16618    N.A.
16629    N.A.
16631    N.A.
16657    N.A.
16666    N.A.
16678    N.A.
16731    N.A.
16732    N.A.
16756    N.A.
16794    N.A.
16862    N.A.
16876    N.A.
16884    N.A.
16899    N.A.
16902    N.A.
16934    N.A.
16947    N.A.
16967    N.A.
17123    N.A.
17152    N.A.
17170    N.A.
17171    N.A.
17178    N.A.
17218    N.A.
17234    N.A.
17249    N.A.
17286    N.A.
17327    N.A.
17330    N.A.
17344    N.A.
17350    N.A.
17367    N.A.
17381    N.A.
17386    N.A.
17429    N.A.
17446    N.A.
17447    N.A.
17470    N.A.
17482    N.A.
17489    N.A.
17490    N.A.
17494    N.A.
17639    N.A.
17651    N.A.
17682    N.A.
17693    N.A.
17694    N.A.
17727    N.A.
17752    N.A.
17807    N.A.
17818    N.A.
17837    N.A.
17857    N.A.
17865    N.A.
17872    N.A.
17877    N.A.
17905    N.A.
17928    N.A.
17935    N.A.
17980    N.A.
17985    N.A.
18098    N.A.
18136    N.A.
18142    N.A.
18187    N.A.
18225    N.A.
18305    N.A.
18327    N.A.
18328    N.A.
18343    N.A.
18360    N.A.
18361    N.A.
18362    N.A.
18378    N.A.
18412    N.A.
18419    N.A.
18434    N.A.
18440    N.A.
18447    N.A.
18478    N.A.
18488    N.A.
18555    N.A.
18627    N.A.
18633    N.A.
18679    N.A.
18698    N.A.
18725    N.A.
18771    N.A.
18786    N.A.
18803    N.A.
18825    N.A.
18845    N.A.
18867    N.A.
18868    N.A.
18887    N.A.
18896    N.A.
18897    N.A.
18898    N.A.
18949    N.A.
18953    N.A.
18965    N.A.
18997    N.A.
19144    N.A.
19148    N.A.
19180    N.A.
19230    N.A.
19238    N.A.
19289    N.A.
19295    N.A.
19324    N.A.
19335    N.A.
19382    N.A.
19410    N.A.
19418    N.A.
19457    N.A.
19465    N.A.
19466    N.A.
19477    N.A.
19608    N.A.
19653    N.A.
19671    N.A.
19714    N.A.
19736    N.A.
19751    N.A.
19788    N.A.
19820    N.A.
19831    N.A.
19878    N.A.
19920    N.A.
19939    N.A.
19941    N.A.
19946    N.A.
19961    N.A.
19978    N.A.
20173    N.A.
20369    N.A.
20375    N.A.
20437    N.A.
20456    N.A.
20477    N.A.
20663    N.A.
20677    N.A.
20986    N.A.
20989    N.A.
20996    N.A.
20997    N.A.
21085    N.A.
21150    N.A.
21477    N.A.
21497    N.A.
21669    N.A.
21931    N.A.
21981    N.A.
22183    N.A.
22359    N.A.
22466    N.A.
22660    N.A.
22766    N.A.
22856    N.A.
22981    N.A.
23159    N.A.
23222    N.A.
23402    N.A.
23504    N.A.
23669    N.A.
23743    N.A.
23951    N.A.
24236    N.A.
24242    N.A.
24296    N.A.
24435    N.A.
24489    N.A.
25485    N.A.
Name: profit, dtype: object

We can get the number of rows with 'N.A.' profit values in another way:

In [15]:
len(data['profit'][data['profit']=='N.A.'])

369

We can change the N.A. profit values to some numeric values through a few steps

### (1) N.A. value replacement on profit dimension

We need to change the type (typecast) of 'profit' column, from str to float64. But before that, we have to replace all 'N.A.' values with an appropriate value. Otherwise, str objects cannot be converted to float64 objects. Here we play with a trick. We use np.nan to replace all 'N.A.'s.

In [18]:
import numpy as np

data.loc[data["profit"] == "N.A.", "profit"] = np.nan

Now, check again how many NaN values in the 'profit' column:

In [19]:
data['profit'].isna().sum()

369

### (2) typecast on profit dimension

We call **astype()** call the profit dimension. Remember to assign the new type back to data.profit.

In [22]:
# Now we will convert it into 'float64' type.
data.profit = data.profit.astype('float64')
  
data['profit'].describe()

count    25131.000000
mean       207.903677
std       1173.695947
min     -98696.000000
25%          8.900000
50%         35.500000
75%        150.500000
max      25330.000000
Name: profit, dtype: float64

### (3) filling for missing values

Now we change the previously 'N.A.'' and current np.nan values to the *average* profit of the corresponding year. Here we need an operation of **groupby + transform**.

Let's first get the average yearly 'profit':

In [24]:
data.groupby('year')['profit'].mean()

year
1955      16.732186
1956      22.509237
1957      23.181087
1958      23.456740
1959      19.279276
1960      24.019439
1961      23.340361
1962      23.326104
1963      26.965000
1964      29.675800
1965      34.543287
1966      40.023000
1967      44.155400
1968      42.801200
1969      48.387400
1970      49.354800
1971      43.952535
1972      47.585569
1973      56.448479
1974      78.461460
1975      88.345547
1976      76.774645
1977     100.138742
1978     107.128921
1979     125.347862
1980     158.932049
1981     165.021748
1982     171.926327
1983     125.104684
1984     140.670143
1985     176.473306
1986     145.980294
1987     134.419916
1988     188.693750
1989     241.518908
1990     219.716632
1991     194.674583
1992     114.938622
1993      -0.405165
1994     129.387810
1995     435.736640
1996     493.942105
1997     606.676815
1998     652.375050
1999     672.704628
2000     825.773387
2001     893.058753
2002     415.736694
2003     140.546263
2004     891.185400
2005    1028.991182
Name: profit, dtype: float64

The following will replace each 'profit' value, no matter 'missing' or not, by the mean profit in its corresponding year group.

In [36]:
# In case we want to see what groupby followed by transform means
data.groupby('year')['profit'].transform('mean')

0          16.732186
1          16.732186
2          16.732186
3          16.732186
4          16.732186
            ...
25495    1028.991182
25496    1028.991182
25497    1028.991182
25498    1028.991182
25499    1028.991182
Name: profit, Length: 25500, dtype: float64

But, we want to apply the same transformation to the missing values only. So we put all functions together:

In [25]:
data['profit'].fillna(data.groupby('year')['profit'].transform('mean'), inplace=True)

In [26]:
data['profit'].describe()

count    25500.000000
mean       207.445384
std       1165.337309
min     -98696.000000
25%          9.000000
50%         36.500000
75%        153.525000
max      25330.000000
Name: profit, dtype: float64

#### Summary

* x = df_merged[continuous_variables].fillna(df_merged.groupby('domain_userid')[continuous_variables].transform('median'))

How do we do it?

* fillna
* groupby
* transform<br>
    * 'mean': other options are 'min', 'max', 'median'
    * inplace=True

## A small example for better understanding groupby + transform

In [37]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two'],
                   'C' : [1, 5, 5, 2, 5, 5]})
df

     A      B  C
0  foo    one  1
1  bar    one  5
2  foo    two  5
3  bar  three  2
4  foo    two  5
5  bar    two  5

In [50]:
df.groupby('A').mean()

            C
A
bar  4.000000
foo  3.666667

In [52]:
df.groupby('A')['C'].transform('mean')

0    3.666667
1    4.000000
2    3.666667
3    4.000000
4    3.666667
5    4.000000
Name: C, dtype: float64

In [51]:
grouped = df.groupby('A')
grouped['C'].transform('mean')

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000241C25C9430>